{
  "diamond": "Diamonds were first discovered in India over 2,500 years ago and have been treasured for their brilliance and hardness ever since. They were believed to bring strength and courage, and became popular in royal jewelry across many cultures.",
  "ruby": "Rubies have been valued since ancient times for their vivid red color and rarity. Associated with love and vitality, they were believed to protect warriors and bring success. Some of the finest rubies historically came from Myanmar.",
  "sapphire": "Sapphires were revered in ancient Persia and thought to make the sky blue. They were worn by royalty and clergy to symbolize wisdom, virtue, and divine favor. The most famous sapphires come from Kashmir, Sri Lanka, and Myanmar.",
  "emerald": "Emeralds were worshipped by the Incas and were favorites of Cleopatra. Associated with fertility and rebirth, they were mined in Egypt as early as 1500 BCE and later in Colombia, which remains one of the top sources today.",
  "amethyst": "Amethyst was once considered as valuable as diamonds. Ancient Greeks believed it protected against intoxication. Its purple hue made it a favorite among royalty and religious figures, especially in medieval Europe.",
  "opal": "Opals were revered by the Romans, who believed they brought good luck and foresight. In the Middle Ages, opals were thought to contain the virtues of all gemstones due to their multicolored flashes. Australia is now the world's primary source.",
  "topaz": "Topaz has been associated with strength and intelligence. In ancient Greece, it was believed to increase strength and make the wearer invisible in times of danger. The name possibly comes from the Sanskrit 'tapas,' meaning fire.",
  "turquoise": "Turquoise has been used in jewelry and spiritual practices for over 5,000 years, especially by Native American tribes and ancient Egyptians. It was considered a sacred stone that brought protection and healing.",
  "garnet": "Garnets were used in ancient Egypt as inlays in jewelry and carved into signet rings in ancient Rome. They symbolize love and were believed to offer protection on journeys. During the Middle Ages, they were used as remedies for inflammatory diseases.",
  "peridot": "Peridot, often called the 'evening emerald,' was mined on the island of Zabargad in the Red Sea as early as 1500 BCE. Ancient Egyptians called it the 'gem of the sun' and believed it protected against nightmares and evil spirits.",
  "quartz": "Quartz, in its various forms like rock crystal, rose quartz, and smoky quartz, has been used for millennia in tools, jewelry, and spiritual practices. Ancient cultures, including those in Japan and Australia, believed it possessed mystical powers and healing properties. Rock crystal, specifically, was often used in divination and ritual."
}